todoist_performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 60
      arrivalRate: 20
      name: "Phase 1"
    - duration: 60
      arrivalRate: 80
      name: "Phase 2"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
  processor: "./my-functions.js"
scenarios:
  - flow:
      - function: "generateRandomData"
      # GET active tasks
      - get:
          url: "/rest/v1/tasks"
      # CREATE new task
      - post:
          url: "/rest/v1/tasks"
          json:
            content: "{{ nameTask }}"
            due_string: "tomorrow at 14:00"
            due_lang: "en"
            priority: 1
          capture:
            json: "$.id"
            as: "id"
      # NEW ID
      - log: "taskID: {{ id }}"
      # GET active task
      - get:
          url: "/rest/v1/tasks/{{ id }}"
      # UPDATE task
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: "{{ nameTask }}"
      # COMPLETE task
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      # REOPEN task
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      # DELETE task
      - delete:
          url: "/rest/v1/tasks/{{ id }}"